In [23]:
import pandas as pd
df = pd.read_json('scaled_transactions_v2.json')
df.head(5)

,transaction_id,customer_id,product,quantity,date,region
0,T001,C001,"{'id': 'P01', 'name': 'Laptop', 'category': 'E...",2,2023-01-03 00:00:00+00:00,East
1,T002,C002,"{'id': 'P03', 'name': 'Monitor', 'category': '...",11,2023-12-01 00:00:00+00:00,South
2,T003,C004,"{'id': 'P03', 'name': 'Monitor', 'category': '...",17,2023-05-30 00:00:00+00:00,West
3,T004,C001,"{'id': 'P02', 'name': 'Mouse', 'category': 'Ac...",20,2023-10-16 00:00:00+00:00,West
4,T005,C002,"{'id': 'P02', 'name': 'Mouse', 'category': 'Ac...",9,2023-01-28 00:00:00+00:00,East

In [24]:
# split the product column
df = pd.concat([df.drop('product', axis=1), df['product'].apply(pd.Series).add_prefix('product_')], axis=1)

# Standardize the date format
df['date'] = pd.to_datetime(df['date']).dt.strftime('%Y-%m-%d')

# Calculate total_value
df['total_value'] = df['quantity'] * df['product_price']

# Handling missing or invalid data
df['customer_id'] = df['customer_id'].fillna('Unknown')
df['quantity'] = df['quantity'].apply(lambda x: max(x, 0))  # Replace negative quantities with zero

df.head(5)

,transaction_id,customer_id,quantity,date,region,product_id,product_name,product_category,product_price,total_value
0,T001,C001,2,2023-01-03,East,P01,Laptop,Electronics,999.99,1999.98
1,T002,C002,11,2023-12-01,South,P03,Monitor,Electronics,299.50,3294.50
2,T003,C004,17,2023-05-30,West,P03,Monitor,Electronics,299.50,5091.50
3,T004,C001,20,2023-10-16,West,P02,Mouse,Accessories,19.99,399.80
4,T005,C002,9,2023-01-28,East,P02,Mouse,Accessories,19.99,179.91

In [70]:
from sqlalchemy import create_engine

# Database Connection (Replace with your credentials)
engine = create_engine("mysql+pymysql://root:root@localhost/appstationdb")
112q3w
# Batch Insert Using `chunksize`
df.to_sql("sales", con=engine, if_exists="append", index=False, chunksize=500)

print("Data loaded successfully in batches!")

Data loaded successfully in batches!